app/Models/AlternatifModel.php

SELECT *
FROM `alternatif`
---
    function get_alternatif()
    {
        return $this->db->table('alternatif')->get();

INSERT INTO `alternatif` (`nama_alternatif`) VALUES ('Alternatif 1')
---
    function insert_alternatif($data)
    {
        return $this->db->table('alternatif')->insert($data);

UPDATE `alternatif` SET `nama_alternatif` = 'Alternatif 1'
WHERE `id_alternatif` = '1'
---
    function update_alternatif($data, $id)
    {
        return $this->db->table('alternatif')->update($data, ['id_alternatif' => $id]);

DELETE FROM `alternatif`
WHERE `id_alternatif` = '2'
---
    function remove_alternatif($id)
    {
        return $this->db->table('alternatif')->delete(['id_alternatif' => $id]);