app/Models/AuthModel.php

    function auth_user($username, $password)
    {
        return $this->db->table('user')->getWhere(['username' => $username, 'password' => hash('sha256', $password)]);
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `password` = '8c6976e5b5410415bde908bd4dee15dfb167a9c873fc4bb8a81f6f2ab448a918'