app/Models/KriteriaModel.php

SELECT *
FROM `kriteria`
---
    function get_kriteria()
    {
        return $this->db->table('kriteria')->get();

UPDATE `kriteria` SET `kode_kriteria` = 'C2', `nama_kriteria` = 'Integritas', `bobot_kriteria` = '0.3', `jenis_kriteria` = 'Benefit'
WHERE `id_kriteria` = '3'
---
    function update_kriteria($data, $id)
    {
        return $this->db->table('kriteria')->update($data, ['id_kriteria' => $id]);

SELECT *
FROM `sub_kriteria`
ORDER BY `nilai` DESC
---
    function get_sub_kriteria()
    {
        return $this->db->table('sub_kriteria')->orderBy('nilai', 'DESC')->get();

INSERT INTO `sub_kriteria` (`nama_sub_kriteria`, `nilai`, `id_kriteria`) VALUES ('Sangat Buruk', '1', '4')
---
    function insert_sub_kriteria($data)
    {
        return $this->db->table('sub_kriteria')->insert($data);