app/Models/PenilaianModel.php

    function get_penilaian()
    {
        return $this->db->table('penilaian tb1')
            ->select('tb1.*,tb2.nama_kriteria')
            ->join('kriteria tb2', 'tb2.id_kriteria = tb1.id_kriteria')
            ->get();
---
SELECT `tb1`.*, `tb2`.`nama_kriteria`
FROM `penilaian` `tb1`
JOIN `kriteria` `tb2` ON `tb2`.`id_kriteria` = `tb1`.`id_kriteria`

    function get_perhitungan()
    {
        return $this->db->table('penilaian tb1')
            ->select('tb1.*,tb2.nama_kriteria,tb3.nama_alternatif')
            ->join('kriteria tb2', 'tb2.id_kriteria = tb1.id_kriteria')
            ->join('alternatif tb3', 'tb3.id_alternatif = tb1.id_alternatif')
            ->groupBy('tb1.id_alternatif')
            ->get();
---
SELECT `tb1`.*, `tb2`.`nama_kriteria`, `tb3`.`nama_alternatif`
FROM `penilaian` `tb1`
JOIN `kriteria` `tb2` ON `tb2`.`id_kriteria` = `tb1`.`id_kriteria`
JOIN `alternatif` `tb3` ON `tb3`.`id_alternatif` = `tb1`.`id_alternatif`
GROUP BY `tb1`.`id_alternatif`

    function insert_penilaian($data, $id)
    {
        return [
            $this->db->table('penilaian')->insertBatch($data),
            $this->db->table('alternatif')->update(['status' => 1], ['id_alternatif' => $id])
---
UPDATE `alternatif` SET `status` = 1
WHERE `id_alternatif` = '3'

    function update_penilaian($data)
    {
        return $this->db->table('penilaian')->updateBatch($data, 'id_penilaian');
---
UPDATE `penilaian`
INNER JOIN (
SELECT '7' `id_penilaian`, '4' `nilai` UNION ALL
SELECT '8' `id_penilaian`, '5' `nilai` UNION ALL
SELECT '9' `id_penilaian`, '4' `nilai`
) `_u`
ON `penilaian`.`id_penilaian` = `_u`.`id_penilaian`
SET
`penilaian`.`nilai` = `_u`.`nilai`

    function get_total()
    {
        return $this->db->table('penilaian')
            ->select('id_kriteria,SUM(pow(nilai,2)) AS total')
            ->groupBy('id_kriteria')
            ->get();
---
SELECT `id_kriteria`, SUM(pow(nilai, 2)) AS total
FROM `penilaian`
GROUP BY `id_kriteria`